{"keras_version": "2.1.1", "backend": "tensorflow", "config": [{"config": {"use_bias": true, "bias_constraint": null, "strides": [1, 1], "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "trainable": true, "name": "conv2d_2", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential"}